"use client"

import { Box, Container, Divider, Typography } from "@mui/material";
import "../../../scss/terms-conditions.scss";

const TermsConditionBng = () => {
  return (
    <Box data-aos="fade-up" >
      <h2 className="terms-title">টুরমার্টের শর্তাবলী ও নীতিমালা</h2>
      <Divider className="divider" />
      <Box>
        <h3 className="terms-section-title">সেবার শর্তাবলীর সংক্ষিপ্তসার</h3>
        <p className="terms-section-text">
          পুরো ওয়েবসাইট জুড়ে Tourmart-কে আমরা, আমাদের, এবং আমাদের প্রতিষ্ঠান
          হিসেবে উল্লেখ করা হয়েছে। আপনি, ব্যবহারকারী, এই ওয়েবসাইটে
          প্রবেশাধিকার পাচ্ছেন Tourmart-এর মাধ্যমে, তবে শর্ত হলো আপনি উপরের
          উল্লিখিত শর্তাবলী, নীতিমালা এবং বিজ্ঞপ্তি মেনে চলবেন। এর মধ্যে রয়েছে
          এই ওয়েবসাইটে উপলব্ধ সকল তথ্য, সম্পদ, এবং সেবা।
        </p>

        <h3 className="terms-section-title">সাইট এবং এর বিষয়বস্তু</h3>
        <p className="terms-section-text">
          অনুগ্রহ করে নিশ্চিত করুন যে আপনি শুধুমাত্র ব্যক্তিগত উদ্দেশ্যে এই
          ওয়েবসাইটটি ব্যবহার করছেন। এই ওয়েবসাইট থেকে কপি করা যেকোনো কন্টেন্ট
          যেমন টেক্সট, ছবি, অডিও, বা ভিডিও বাণিজ্যিক, জনসাধারণ বা ব্যবসায়িক
          উদ্দেশ্যে বিতরণ, বিনিময়, পরিবর্তন, বিক্রি বা প্রেরণ করা নিষিদ্ধ।
        </p>

        <h3 className="terms-section-title">মালিকানা</h3>
        <p className="terms-section-text">
          কপিরাইট আইন এবং আন্তর্জাতিক কনভেনশনসমূহ এই ওয়েবসাইটের কন্টেন্টকে
          সুরক্ষিত ও রক্ষা করে, যার মধ্যে অডিও, ছবি, সফটওয়্যার, টেক্সট, আইকন
          এবং অন্যান্য অনুরূপ কন্টেন্ট অন্তর্ভুক্ত।
        </p>

        <h3 className="terms-section-title">অন্যান্য অধিকার</h3>
        <p className="terms-section-text">
          আপনি এই ওয়েবসাইটে থাকা বুলেটিন বোর্ড, চ্যাট রুম, মেইলিং লিস্ট এবং
          অন্যান্য বার্তা ও যোগাযোগ সুবিধাগুলি শুধুমাত্র সংশ্লিষ্ট এবং উপযুক্ত
          কন্টেন্ট প্রেরণ ও গ্রহণের জন্য ব্যবহারে সম্মত হচ্ছেন।
        </p>

        <h3 className="terms-section-title">ব্যবহারকারীর উপকরণ</h3>
        <p className="terms-section-text">
          এমন কিছু পোস্ট করা বা পাঠানো নিষিদ্ধ যা অপরাধমূলক কর্মকাণ্ড হিসেবে
          গণ্য হতে পারে বা এমন আচরণকে উৎসাহিত করে যা দেওয়ানি দায়বদ্ধতার কারণ
          হতে পারে, বা অন্যভাবে কোনো আইনের লঙ্ঘন করে। এর মধ্যে মানহানিকর,
          মিথ্যা, অশ্লীল, পর্নোগ্রাফিক, অশোভন, হুমকিমূলক বা অবৈধ কন্টেন্ট
          অন্তর্ভুক্ত তবে সীমাবদ্ধ নয়।
        </p>

        <h3 className="terms-section-title">
          সিস্টেম ত্রুটি এবং তৃতীয় পক্ষের কার্যকলাপের জন্য দায়
        </h3>
        <p className="terms-section-text">
          Tourmart একটি মধ্যস্থতাকারী হিসেবে ভ্রমণ সেবা প্রদান করে, যার মধ্যে
          ফ্লাইট বুকিংসহ অন্যান্য সেবা অন্তর্ভুক্ত। এই কারণে, Tourmart কোনো
          বিমান সংস্থা, গ্লোবাল ডিস্ট্রিবিউশন সিস্টেম (GDS), অন্যান্য সফটওয়্যার
          প্ল্যাটফর্ম, বা আমাদের প্রযুক্তিগত অবকাঠামোর কারণে সৃষ্ট ত্রুটি, বাদ
          পড়া, বা ব্যর্থতার জন্য দায়ী নয়, যেগুলো আমাদের প্রত্যক্ষ
          নিয়ন্ত্রণের বাইরে। এমন কোনো সমস্যার ক্ষেত্রে—যেমন বুকিং ত্রুটি,
          ফ্লাইট বাতিল, সময়সূচি পরিবর্তন, বা সেবা ব্যাহত হওয়া—সমাধান
          প্রাসঙ্গিক বিমান সংস্থা বা সেবা প্রদানকারীর নীতিমালা, নির্দেশিকা এবং
          পদ্ধতি অনুযায়ী পরিচালিত হবে। আইনসম্মতভাবে যতটুকু অনুমোদিত, Tourmart
          কোনো প্রকার সরাসরি, পরোক্ষ, আকস্মিক, বিশেষ বা ফলস্বরূপ ক্ষতি, লোকসান,
          বা ব্যয়ের জন্য দায়ী থাকবে না যা এসব ত্রুটি, বাদ পড়া বা ব্যর্থতার
          কারণে সৃষ্ট। আমাদের সেবা ব্যবহার করার মাধ্যমে, আপনি স্বীকার করছেন ও
          সম্মত হচ্ছেন যে, এমন সমস্যার সমাধানের জন্য আপনার দাবি সংশ্লিষ্ট বিমান
          সংস্থা বা সেবা প্রদানকারীর সাথেই হবে এবং এই বিষয়ে আপনি Tourmart-কে
          সকল দায় থেকে অব্যাহতি দিচ্ছেন। আপনি আরও স্বীকার করছেন যে, Tourmart
          কোনো তৃতীয় পক্ষের—যেমন বিমান সংস্থা, হোটেল বা অন্যান্য ভ্রমণ সেবা
          প্রদানকারীদের—কার্যকলাপ বা অবহেলার জন্য দায়ী নয়।
        </p>

        <h3 className="terms-section-title">
          GDS PNR শেয়ারিং নীতিমালা সম্পর্কিত ব্যাখ্যা
        </h3>
        <p className="terms-section-text">
          আমাদের কোম্পানির নীতি অনুসারে, আমরা কোনো পরিস্থিতিতেই GDS PNR শেয়ার
          করি না—এই বিষয়টি স্পষ্টভাবে জানানো হচ্ছে। ইতিমধ্যে প্রদত্ত এয়ারলাইন
          PNR এবং ই-টিকিট নম্বর যেকোনো এয়ারলাইন সম্পর্কিত যাচাই, সহায়তা বা
          সমর্থনের জন্য সম্পূর্ণ যথেষ্ট। তদুপরি, আমাদের OTA অংশীদার বা এজেন্টদের
          কাছে GDS PNR প্রকাশ করার কোনো প্রয়োজনীয়তা বা বাধ্যবাধকতা নেই। এই
          নীতিমালা মেনে চলার জন্য আপনার বোঝাপড়া এবং সহযোগিতার জন্য আমরা কৃতজ্ঞ।
        </p>

        <h3 className="terms-section-title">
          জরিমানা নীতি (রিফান্ড, রিইস্যু, ভয়েড)
        </h3>
        <p className="terms-section-text">
          রিফান্ড, রিইস্যু এবং ভয়েড সম্পর্কিত সকল জরিমানা ট্যুর মার্ট
          লিমিটেড-এর নীতি অনুযায়ী নির্ধারিত হয়, যা বুকিং প্রক্রিয়ার সময়
          স্বচ্ছভাবে প্রদর্শিত হয়। গ্রাহকদের দৃঢ়ভাবে পরামর্শ দেওয়া হচ্ছে যে
          তারা টিকিট ইস্যু করার আগে প্রযোজ্য জরিমানার বিবরণ সতর্কতার সাথে
          পর্যালোচনা করবেন। বুকিং প্রক্রিয়ায় এগিয়ে গিয়ে টিকিট নিশ্চিত করার
          মাধ্যমে এটি বিবেচনা করা হবে যে গ্রাহক প্রদর্শিত জরিমানা নীতিমালা
          স্বীকার ও মেনে নিয়েছেন। দয়া করে লক্ষ্য করুন যে জরিমানার পরিমাণ ভাড়া
          প্রকার, সার্ভিস ক্লাস এবং বুকিং শর্তের উপর ভিত্তি করে পরিবর্তিত হতে
          পারে। ট্যুর মার্ট তার কার্যক্রমের নির্দেশিকার সাথে সঙ্গতি রেখে পরিষেবা
          বা প্রশাসনিক চার্জ প্রয়োগ করার অধিকারও সংরক্ষণ করে।
        </p>

        <h3 className="terms-section-title">রিফান্ড নীতি</h3>
        <p className="terms-section-text">
          এই রিফান্ড নীতিমালায় আমাদের প্ল্যাটফর্মের মাধ্যমে করা বুকিংয়ের জন্য
          রিফান্ড প্রক্রিয়ার শর্তাবলী এবং নীতিমালা বর্ণনা করা হয়েছে। বুকিং
          করার মাধ্যমে ব্যবহারকারীরা নিম্নলিখিত শর্তাবলীতে সম্মত হন:
        </p>

        <Box>
          <Typography
            sx={{
              color: "#6e6996",
              fontFamily: "Outfit",
              fontSize: "16px",
              paddingBottom: "5px",
              fontWeight: 700,
            }}
          >
            ১. আংশিক পেমেন্ট এবং বাকি অর্থ
          </Typography>

          <Box
            sx={{
              paddingLeft: "15px",
            }}
          >
            <Typography
              sx={{
                color: "#6e6996",
                fontFamily: "Outfit",
                fontSize: "16px",
              }}
            >
              • <strong>পেমেন্টের দায়িত্ব:</strong> যারা আংশিক পেমেন্ট বেছে
              নেন, তাদের নির্ধারিত সময়সীমার মধ্যে বাকি অর্থ পরিশোধ করতে হবে।
            </Typography>
            <Typography
              sx={{
                color: "#6e6996",
                fontFamily: "Outfit",
                fontSize: "16px",
              }}
            >
              • <strong>পরিশোধে ব্যর্থতা:</strong> নির্ধারিত সময়ের মধ্যে বাকি
              অর্থ পরিশোধ না হলে, বুকিংটি বাতিল হিসেবে গণ্য হবে।
            </Typography>
            <Typography
              sx={{
                color: "#6e6996",
                fontFamily: "Outfit",
                fontSize: "16px",
              }}
            >
              • <strong>রিফান্ডের যোগ্যতা:</strong> এ ধরনের ক্ষেত্রে প্রাথমিক
              আংশিক পেমেন্ট ফেরত দেওয়া হবে না।
            </Typography>
          </Box>
        </Box>

        <Box mt={2}>
          <Typography
            sx={{
              color: "#6e6996",
              fontFamily: "Outfit",
              fontSize: "16px",
              paddingBottom: "5px",
              fontWeight: 700,
            }}
          >
            ২. রিফান্ড চার্জ
          </Typography>

          <Box
            sx={{
              paddingLeft: "15px",
            }}
          >
            <Typography
              sx={{
                color: "#6e6996",
                fontFamily: "Outfit",
                fontSize: "16px",
              }}
            >
              • <strong>চার্জ নির্ধারণ:</strong>
              যদি রিফান্ডের অনুরোধ করা হয় এবং সংশ্লিষ্ট রিফান্ড প্রসেসিং চার্জ
              প্রদত্ত আংশিক পেমেন্টের পরিমাণ অতিক্রম করে, তাহলে ব্যবহারকারীকে
              অতিরিক্ত চার্জ বহন করতে হবে।
            </Typography>
            <Typography
              sx={{
                color: "#6e6996",
                fontFamily: "Outfit",
                fontSize: "16px",
              }}
            >
              • <strong>চার্জ পরিশোধ:</strong> রিফান্ড প্রক্রিয়া সম্পন্ন করার
              জন্য ব্যবহারকারীকে বাকি অর্থ পরিশোধ করতে হবে।
            </Typography>
          </Box>
        </Box>

        <Box mt={2}>
          <Typography
            sx={{
              color: "#6e6996",
              fontFamily: "Outfit",
              fontSize: "16px",
              paddingBottom: "5px",
              fontWeight: 700,
            }}
          >
            ৩. ব্যবহারকারীর উদ্যোগে রিফান্ডের অনুরোধ
          </Typography>

          <Box
            sx={{
              paddingLeft: "15px",
            }}
          >
            <Typography
              sx={{
                color: "#6e6996",
                fontFamily: "Outfit",
                fontSize: "16px",
              }}
            >
              • <strong>মানক প্রক্রিয়াকরণ:</strong>
              ব্যবহারকারীর দ্বারা করা রিফান্ড অনুরোধ (যা অপ্রদানের কারণে নয়)
              আমাদের মানক রিফান্ড পদ্ধতির আওতায় প্রক্রিয়াকৃত হবে।
            </Typography>
            <Typography
              sx={{
                color: "#6e6996",
                fontFamily: "Outfit",
                fontSize: "16px",
              }}
            >
              • <strong>প্রক্রিয়াকরণের সময়:</strong>
              এই ধরনের রিফান্ড আমাদের সাধারণ রিফান্ড সময়সীমা এবং নীতিমালা
              অনুযায়ী সম্পন্ন হবে।
            </Typography>
          </Box>
        </Box>

        <Box mt={2}>
          <Typography
            sx={{
              color: "#6e6996",
              fontFamily: "Outfit",
              fontSize: "16px",
              paddingBottom: "5px",
              fontWeight: 700,
            }}
          >
            ৪. সাধারণ শর্তাবলী
          </Typography>

          <Box
            sx={{
              paddingLeft: "15px",
            }}
          >
            <Typography
              sx={{
                color: "#6e6996",
                fontFamily: "Outfit",
                fontSize: "16px",
              }}
            >
              • <strong>নীতিমালা আপডেট:</strong> আমরা যে কোনও সময় এই রিফান্ড
              নীতিমালা পরিবর্তন করার অধিকার সংরক্ষণ করি। পরিবর্তনগুলি আমাদের
              ওয়েবসাইটে প্রকাশের সঙ্গে কার্যকর হবে।
            </Typography>
            <Typography
              sx={{
                color: "#6e6996",
                fontFamily: "Outfit",
                fontSize: "16px",
              }}
            >
              • <strong>যোগাযোগের তথ্য:</strong> এই নীতিমালা সংক্রান্ত যেকোনো
              প্রশ্ন বা উদ্বেগের জন্য, দয়া করে আপনার KAM বা টুর মার্ট সাপোর্ট
              টিমের সঙ্গে যোগাযোগ করুন।
            </Typography>
          </Box>
        </Box>
      </Box>
    </Box>
  );
};

export default TermsConditionBng;
